Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: GraphQL is a query language for APIs and a runtime for fulfilling those queries with your existing data. GraphQL provides a complete and understandable description of the data in your API, gives clients the power to ask for exactly what they need and nothing more, makes it easier to evolve APIs over time, and enables powerful developer tools.
ja_jp: GraphQLは、APIのクエリ言語であり、既存のデータでこれらのクエリを実行するためのランタイムです。 GraphQLは、API内のデータの完全で理解しやすい説明を提供し、クライアントが必要なものだけを正確に要求できるようにし、時間の経過とともにAPIを進化させやすくし、強力な開発者ツールを実現にします。

source: GraphQL is not a replacement for REST API specification but merely an alternative. Unlike REST, GraphQL API's have the ability to benefit the client by:
ja_jp: GraphQLはREST APIの仕様を置き換えるものではなく、単なる別の手段です。RESTとは異なり、GraphQL APIは以下のようにクライアントに利益をもたらす機能を持っています。

source: GraphQL non-blocking support
ja_jp: GraphQLのノンブロッキング対応

source: GraphQL: implement and query (client) data store using GraphQL. Offers Mutiny APIs and subscriptions as event streams.
ja_jp: GraphQL: GraphQLを使用して（クライアント）データストアを実装し、クエリを実行します。Mutiny APIとイベントストリームとしてサブスクリプションを提供します。

source: GraphiQL UI is a great tool permitting easy interaction with your GraphQL APIs.
ja_jp: GraphiQL UIは、GraphQL APIとの簡単なやり取りを可能にする素晴らしいツールです。

source: GraphiQL can be accessed from http://localhost:8080/q/graphql-ui/ .
ja_jp: GraphiQLは、 http://localhost:8080/q/graphql-ui/ からアクセスできます。

source: Great! We are now exposing our Quarkus Application metrics in OpenShift!
ja_jp: 素晴らしい!OpenShiftにQuarkus Applicationのメトリクスを公開出来ています!

source: GreetingsResource with OpenTelemetry manual instrumentation
ja_jp: OpenTelemetry 手動計装による GreetingsResource

source: Group a consumer acknowledgment for a specified time. + By default, a consumer uses 100ms grouping time to send out acknowledgments to a broker. + Setting a group time of 0 sends out acknowledgments immediately. + A longer ack group time is more efficient at the expense of a slight increase in message re-deliveries after a failure.
ja_jp: コンシューマの確認応答を指定時間グループ化します。 デフォルトでは、コンシューマはブローカに確認応答を送信するのに100msのグループ化時間を使用します。 グループ化時間を 0 に設定すると、確認応答を直ちに送信します。 グループ化時間を長くすると効率的ですが、その分失敗後のメッセージ再送が若干増えます。

source: Group a consumer acknowledgment for the number of messages.
ja_jp: メッセージの数だけコンシューマー確認をグループ化します。

source: Group multiple configuration properties into an object.
ja_jp: 複数の設定プロパティをオブジェクトにグループ化

source: Grouping parameters in a custom class
ja_jp: カスタムクラスでパラメータをグループ化

source: Grouping properties
ja_jp: プロパティーのグループ化

source: Guardrails & Privacy
ja_jp: ガードレールとプライバシー

source: Guidance and references to help you contribute to Quarkus.
ja_jp: Quarkusに貢献するためのガイダンスとリファレンス。

source: Guidance for testing Quarkus Security features and ensuring that your Quarkus applications are securely protected is provided in the Quarkus xref:security-testing.adoc[Security testing] guide.
ja_jp: Quarkus Securityの機能をテストし、Quarkusアプリケーションが安全に保護されていることを確認するためのガイダンスは、Quarkus xref:security-testing.adoc[セキュリティテストガイド] に記載されています。

source: Guide for Extension Developers
ja_jp: エクステンション開発者向けガイド

source: Guide for extension developers
ja_jp: エクステンション開発者向けガイド

source: Guide to send Micrometer data to OpenTelemetry.
ja_jp: Micrometer データを OpenTelemetry に送信するためのガイド

source: Guidelines
ja_jp: ガイドライン

source: Guidelines are provided to help you to contribute clear and consistent content that is also sourced in the required diataxis structure and composition of Quarkus documentation.
ja_jp: ガイドラインは、Quarkusドキュメントに必要な構造や構成に基づいた、明確で一貫性のあるコンテンツを提供するためのものです。

source: Guidelines are provided to help you to contribute clear and consistent content that is also sourced in the required structure and composition of Quarkus documentation.
ja_jp: ガイドラインは、Quarkus ドキュメントの必要な構造と構成をソースとする明確で一貫性のあるコンテンツを提供するのに役立つように提供されています。

source: Guides
ja_jp: ガイド

source: Guides - Latest
ja_jp: ガイド - 最新

source: Guiding principles
ja_jp: 基本原則

source: H2 (in-process)
ja_jp: H2 (インプロセス)

source: H2 and Derby databases can be configured to run in "embedded mode"; however, the Derby extension does not support compiling the embedded database engine into native executables.
ja_jp: H2およびDerbyデータベースは、"組み込みモード "で実行するように設定することができます。しかし、Derbyエクステンションは、組み込みデータベースエンジンをネイティブ実行可能ファイルにコンパイルすることをサポートしていません。

source: H2 database connector
ja_jp: H2 データベースコネクター

source: H2 example
ja_jp: H2の例

source: H2 is a database that can run in embedded or server mode. It can use a file storage or run entirely in memory. All of these options are available as listed above.
ja_jp: H2は、組み込みモードでもサーバーモードでも動作するデータベースです。 ファイルストレージを使用することも、完全にメモリ内で実行することもできます。 これらのオプションはすべて、上記のように利用可能です。

source: H2 is an embedded database. It can run as a server, based on a file, or live completely in memory. All of these options are available as listed above. You can find more information at the https://h2database.com/html/features.html?highlight=url&search=url#database_url[official documentation].
ja_jp: H2 は組み込みデータベースです。サーバーとして、ファイルに基づいて、あるいは、メモリー内で完全にライブで実行できます。これらすべてのオプションは上記のように利用可能です。詳細は、link:https://h2database.com/html/features.html?highlight=url&search=url#database_url[公式ドキュメント] にあります。

source: HISTOGRAM
ja_jp: ヒストグラム

source: HTML Example
ja_jp: HTML の例

source: HTTP Basic Authentication is one of the least resource-demanding techniques that enforce access controls to the Web resources.
ja_jp: HTTPBasic認証は、Webリソースへのアクセス制御を実施する最もリソースを必要としない技術の1つです。

source: HTTP Basic Authentication is one of the least resource-demanding techniques that enforce access controls to the Web resources. It uses fields in the HTTP header and does not require HTTP cookies, session identifiers, or login pages.
ja_jp: HTTP Basic認証は、Webリソースへのアクセス制御を実施するための最もリソースを必要としない技術の一つです。HTTPヘッダーのフィールドを使用し、HTTPクッキー、セッション識別子、ログインページを必要としません。

source: HTTP Basic authentication is one of the least resource-demanding techniques that enforce access controls to web resources.
ja_jp: HTTP Basic認証は、Webリソースへのアクセス制御を実施する手法の中で、最もリソースを必要としないものの一つです。

source: HTTP Basic authentication is one of the least resource-demanding techniques that enforce access controls to web resources. You can secure your Quarkus application endpoints by using HTTP Basic authentication. Quarkus includes a built-in authentication mechanism for Basic authentication.
ja_jp: HTTP Basic認証は、Webリソースへのアクセス制御を実施する最もリソースを必要としないテクニックの1つです。 HTTPBasic認証を使用することで、Quarkusアプリケーションのエンドポイントを保護できます。Quarkusには、Basic認証用の認証メカニズムが組み込まれています。

source: HTTP Basic authentication is one of the least resource-demanding techniques that enforce access controls to web resources. You can secure your Quarkus application endpoints with HTTP Basic authentication. Quarkus provides a built-in authentication mechanism for Basic authentication.
ja_jp: HTTP Basic認証は、Webリソースへのアクセス制御を実施する手法の中で、最もリソースを必要としない手法の1つです。QuarkusアプリケーションのエンドポイントをHTTP Basic認証で保護することができます。Quarkusには、Basic認証のための組込の認証メカニズムがあります。

source: HTTP Compression
ja_jp: HTTP圧縮

source: HTTP GET `/q/arc/beans` - returns the list of all beans
ja_jp: HTTP GET `/q/arc/beans` - すべての Bean のリストを返します。

source: HTTP GET `/q/arc/observers` - returns the list of all observer methods
ja_jp: HTTP GET `/q/arc/observers` - すべてのオブザーバーメソッドのリストを返します。

source: HTTP GET `/q/arc/removed-beans` - returns the list of unused beans removed during build
ja_jp: HTTP GET `/q/arc/removed-beans` - ビルド中に削除された未使用の Bean のリストを返します。

source: HTTP GET `/q/arc` - returns the summary; number of beans, config properties, etc.
ja_jp: HTTP GET `/q/arc` - 要約、Bean の数、設定プロパティーなどを返します。

source: HTTP Limits Configuration
ja_jp: HTTP 制限の設定

source: HTTP Method
ja_jp: HTTP メソッド

source: HTTP Method records the HTTP Method accessed by the client. This will record a string of HTTP methods such as GET, POST, DELETE, and other general HTTP methods.
ja_jp: HTTP メソッドは、クライアントがアクセスした HTTP メソッドを記録します。 これにより、GET、POST、DELETE などの HTTP メソッドやその他の一般的な HTTP メソッドの文字列が記録されます。

source: HTTP Multipart support in Quarkus REST does **not** reuse the same types or annotations as RESTEasy Classic and thus users are encouraged to read <<rest.adoc#multipart,this>> part of the reference documentation.
ja_jp: Quarkus REST の HTTP マルチパートサポートは、RESTEasy Classic と同じ型やアノテーションを再利用しないため、ユーザーには、<<rest.adoc#multipart,this>> リファレンスドキュメントの一部を参照することを推奨します。

source: HTTP Multipart support in RESTEasy Reactive does **not** reuse the same types or annotations as RESTEasy Classic and thus users are encouraged to read <<resteasy-reactive#multipart,this>> part of the reference documentation.
ja_jp: RESTEasy ReactiveのHTTP Multipartサポートは、RESTEasy Classicと同じ型やアノテーションを再利用して *いない* ため、ユーザーはリファレンスドキュメントの link:resteasy-reactive.html#multipart[この]部分を読むことが推奨されます。

source: HTTP Multipart support in RESTEasy Reactive does **not** reuse the same types or annotations as RESTEasy Classic and thus users are encouraged to read xref:resteasy-reactive.adoc#multipart[this] part of the reference documentation.
ja_jp: RESTEasy ReactiveのHTTP Multipartサポートは、RESTEasy Classicと同じ型やアノテーションを再利用 *しない* ため、ユーザーはリファレンスドキュメントの xref:resteasy-reactive.adoc#multipart[この] 部分を読むことが推奨されます。

source: HTTP Reference
ja_jp: HTTPリファレンス

source: HTTP Reference Documentation
ja_jp: HTTPリファレンスドキュメント

source: HTTP `Authorization` header with the `Bearer` scheme is typically used to send the bearer access token. For example: `Authorization: Bearer <token>`.
ja_jp: ベアラーアクセストークンの送信には、通常 `Bearer` スキームを用いた HTTP `Authorization` ヘッダーが使用されます。例: `Authorization: Bearer <token>`。

source: HTTP and WebSocket architecture styles
ja_jp: HTTP および WebSocket アーキテクチャースタイル

source: HTTP element
ja_jp: HTTP 要素

source: HTTP filters and interceptors
ja_jp: HTTP フィルターとインターセプター

source: HTTP headers used during the original request are not available after the redirect
ja_jp: 元のリクエスト中に使用された HTTP ヘッダーは、リダイレクト後に使用できなくなります。

source: HTTP is provided using Eclipse Vert.x as the base HTTP layer. Servlet's are supported using a modified version of Undertow that runs on top of Vert.x, and RESTEasy is used to provide JAX-RS support. If Undertow is present RESTEasy will run as a Servlet filter, otherwise it will run directly on top of Vert.x with no Servlet involvement.
ja_jp: HTTP はベースとなる HTTP レイヤーとして Eclipse Vert.x を使用して提供されます。サーブレットは Vert.x の上で動作する Undertow の修正版を使用してサポートされています。また、JAX-RS のサポートには RESTEasy が使用されています。Undertow が存在する場合、RESTEasy はサーブレットフィルターとして動作します。そうでない場合は、サーブレットの関与なしに Vert.x の上で直接動作します。

source: HTTP is provided using Eclipse Vert.x as the base HTTP layer. Servlet's are supported using a modified version of Undertow that runs on top of Vert.x, and RESTEasy is used to provide Jakarta REST support. If Undertow is present RESTEasy will run as a Servlet filter, otherwise it will run directly on top of Vert.x with no Servlet involvement.
ja_jp: HTTPは、ベースとなるHTTPレイヤーとしてEclipse Vert.xを使用して提供されます。サーブレットは、Vert.x上で動作するUndertowの修正バージョンを使用してサポートされ、RESTEasyは、Jakarta RESTサポートを提供するために使用されます。Undertowが存在する場合、RESTEasyはServletフィルターとして実行され、そうでない場合は、Servletの関与なしにVert.xの上で直接実行されます。

source: HTTP method annotations
ja_jp: HTTPメソッドアノテーション

source: HTTP microservices
ja_jp: HTTP マイクロサービス

source: HTTP port
ja_jp: HTTP ポート

source: HTTP proxy host.
ja_jp: HTTP プロキシーホスト。

source: HTTP proxy port.
ja_jp: HTTP プロキシーポート。

source: HTTP request
ja_jp: HTTP リクエスト

source: HTTP request parameter annotations
ja_jp: テーブル HTTP リクエストパラメーターアノテーション

source: HTTP requests will be redirected to the HTTPS port
ja_jp: HTTP リクエストは HTTPS ポートにリダイレクトされます。

source: HTTP response
ja_jp: HTTP レスポンス

source: HTTP server
ja_jp: HTTP サーバー

source: HTTP server configuration
ja_jp: HTTP サーバーの設定

source: HTTP status code of the response
ja_jp: レスポンスの HTTP ステータスコード

source: HTTP upgrade is only secured when a security annotation is declared on an endpoint class next to the `@WebSocket` annotation. Placing a security annotation on an endpoint bean will not secure bean methods, only the HTTP upgrade. You must always verify that your endpoint is secured as intended.
ja_jp: HTTP アップグレードは、エンドポイントクラスで `@WebSocket` アノテーションの隣でセキュリティーアノテーションが宣言されている場合にのみ保護されます。 エンドポイント Bean にセキュリティーアノテーションを配置しても、Bean メソッドは保護されず、HTTP アップグレードのみが保護されます。 エンドポイントが意図したとおりに保護されていることを常に確認する必要があります。

source: HTTP/2 Support
ja_jp: HTTP/2 サポート

source: HTTP/2 is disabled by default in REST Client. If you want to enable it, you can set:
ja_jp: REST Clientでは、HTTP/2はデフォルトで無効になっています。有効にしたい場合は、次のように設定することができます:

source: HTTP/2 is enabled by default, and will be used by browsers if SSL is in use on JDK11 or higher. JDK8 does not support ALPN so cannot be used to run HTTP/2 over SSL. Even if SSL is not in use HTTP/2 via cleartext upgrade is supported, and may be used by non-browser clients.
ja_jp: HTTP/2 はデフォルトで有効になっており、JDK11 以降で SSL が使用されている場合はブラウザーで使用されます。JDK8 は ALPN をサポートしていないため、SSL 上で HTTP/2 を実行するために使用することはできません。SSL が使用されていない場合でも、クリアテキストのアップグレードによる HTTP/2 はサポートされており、ブラウザー以外のクライアントでも使用することができます。

source: HTTP/2 is enabled by default, and will be used by browsers if SSL is in use. Even if SSL is not in use HTTP/2 via cleartext upgrade is supported, and may be used by non-browser clients.
ja_jp: HTTP/2はデフォルトで有効になっており、SSLが使用されている場合はブラウザで使用されます。 SSL が使用されていない場合でも、クリアテキストアップグレードによる HTTP/2 はサポートされており、ブラウザ以外のクライアントで使用される可能性があります。

source: HTTPS Redirect URI
ja_jp: HTTPS リダイレクトURI

source: Handle failures
ja_jp: 失敗のハンドリング

source: Handle the POST form request, this method can only be invoked if the CSRF filter has successfully verified the token.
ja_jp: フォームの POST リクエストを処理します。このメソッドは、CSRF フィルターがトークンの確認に成功した場合にのみ呼び出すことができます。

source: Handle the form POST request, this method can only be invoked if the CSRF filter has successfully verified the token.
ja_jp: フォームの POST リクエストを処理します。このメソッドは、CSRF フィルタがトークンの確認に成功した場合にのみ呼び出すことができます。

source: Handle your database schema migrations
ja_jp: データベーススキーマの移行を処理

source: Handler adding the start-time, if enabled in the configuration.
ja_jp: コンフィギュレーションで有効になっていれば、開始時間を追加するハンドラ。

source: Handlers that add headers specified in the configuration.
ja_jp: コンフィギュレーションで指定されたヘッダーを追加するハンドラ。

source: Handling Deserialization Failures
ja_jp: デシリアライゼーション失敗時の処理

source: Handling Failures
ja_jp: 失敗時の対応

source: Handling Multipart Form data
ja_jp: マルチパートフォームデータの処理

source: Handling Serialization Failures
ja_jp: シリアライゼーション失敗時の処理

source: Handling Streams
ja_jp: ストリームの処理

source: Handling and controlling the lifetime of authentication
ja_jp: 認証のライフタイムの処理と制御

source: Handling conflicting routes
ja_jp: 競合するルートの処理

source: Handling dates
ja_jp: 日付の取り扱い

source: Handling failures
ja_jp: 失敗の処理

source: Handling login and registration endpoints yourself
ja_jp: ログインと登録のエンドポイントを自分でハンドリングする

source: Handling malformed input
ja_jp: 不正な入力の処理

source: Handling ping/pong messages
ja_jp: ping/pong メッセージの処理

source: Handling restarts
ja_jp: 再起動のハンドリング

source: Handling security issues
ja_jp: セキュリティー問題への対応

source: Handling streams
ja_jp: ストリームの取り扱い

source: Handling web sockets
ja_jp: WebSocketの取り扱い

source: Handshake timeout
ja_jp: ハンドシェイクタイムアウト

source: Hang Detection
ja_jp: ハング検出

source: Happy with the code? Let's make a Codestart out of it.
ja_jp: コードに満足していますか? そこから Codestart を作成しましょう。

source: Hard constraints are weighted against other hard constraints. Soft constraints are weighted too, against other soft constraints. *Hard constraints always outweigh soft constraints*, regardless of their respective weights.
ja_jp: ハード制約は、他のハード制約に対して重み付けされます。ソフト制約も、他のソフト制約に対して重み付けされます。*それぞれの重みに関係なく、ハード制約は常にソフト制約の重みを上回ります*。

source: Hard constraints must not be broken. For example: _A room can have at most one lesson at the same time._
ja_jp: ハード制約を破ってはいけません。例: _教室は同時に最大 1 つのレッスンを持つことができます。_

source: Hardcoded values in your code are a _no go_ (even if we all did it at some point ;-)). In this guide, we will learn how to configure a Quarkus application.
ja_jp: コードの中にハードコードされた値を使うことは _できません_ (たとえ誰もがどこかの時点でそうしていたとしてもです ;-)。このガイドでは、Quarkusアプリケーションを設定する方法を学びます。

source: Hardcoded values in your code are a _no-go_ (even if we all did it at some point ;-)). In this guide, we will learn how to configure a Quarkus application.
ja_jp: コードの中にハードコードされた値を使うことは _できません_ (たとえ誰もがどこかの時点でそうしていたとしてもです ;-)。このガイドでは、Quarkusアプリケーションを設定する方法を学びます。

source: Hardcoded values in your code is a no go (even if we all did it at some point ;-)).
ja_jp: コードにハードコードされた値を入れるのはNGです（たとえ、私たち全員がいつかはやってしまったとしても;-)）。

source: Hardcoded values in your code is a no go (even if we all did it at some point ;-)). In this guide, we learn how to configure your application.
ja_jp: コードの中でハードコードされた値を使用することはできません (たとえ誰もがどこかの時点でそうしていたとしても ;-)。このガイドでは、アプリケーションを設定する方法を学びます。

source: Harden the platform
ja_jp: プラットフォームの堅牢化

source: Has a method annotated with a security annotation such as `@RolesAllowed`.
ja_jp: `@RolesAllowed` などのセキュリティーアノテーションが付けられたメソッドがあります。

source: Has access to `ANNOTATION_STORE`, `QUALIFIERS`, `INTERCEPTOR_BINDINGS`, `STEREOTYPES`
ja_jp: `ANNOTATION_STORE` , `QUALIFIERS` , `INTERCEPTOR_BINDINGS` . `STEREOTYPES` にアクセスできます。

source: Has access to `ANNOTATION_STORE`, `QUALIFIERS`, `INTERCEPTOR_BINDINGS`, `STEREOTYPES`, `BEANS` (class-based beans only), `OBSERVERS` (class-based observers only), `INJECTION_POINTS`
ja_jp: `ANNOTATION_STORE`, `QUALIFIERS`, `INTERCEPTOR_BINDINGS`, `STEREOTYPES`, `BEANS` (クラスベースBeanのみ), `OBSERVERS` (クラスベースobserverのみ), `INJECTION_POINTS` にアクセスできます。

source: Has access to `ANNOTATION_STORE`, `QUALIFIERS`, `INTERCEPTOR_BINDINGS`, `STEREOTYPES`, `BEANS`, `OBSERVERS` (class-based observers only), `INJECTION_POINTS`
ja_jp: `ANNOTATION_STORE` , `QUALIFIERS` , `INTERCEPTOR_BINDINGS` , `STEREOTYPES` , `BEANS` , `OBSERVERS` (クラスベースのオブザーバーのみ), `INJECTION_POINTS` にアクセス可能です。

source: Has access to all build metadata
ja_jp: すべてのビルドメタデータにアクセスできます

source: Hashes the password using bcrypt with 10 iterations (default).
ja_jp: bcrypt を使用して、10 回のイテレーション (デフォルト) でパスワードをハッシュ化します。

source: Hashing function determining the partition where you publish a particular message (partitioned topics only). + Available options are as follows: + * `pulsar.JavastringHash`: the equivalent of `string.hashCode()` in Java + * `pulsar.Murmur3_32Hash`: applies the https://en.wikipedia.org/wiki/MurmurHash[Murmur3] hashing function + * `pulsar.BoostHash`: applies the hashing function from C++'s https://www.boost.org/doc/libs/1_62_0/doc/html/hash.html[Boost] library
ja_jp: 特定のメッセージを公開するパーティションを決定するハッシュ関数 (パーティション化されたトピックのみ)。 使用可能なオプションは以下のとおりです：+ * `pulsar.JavastringHash` : Java の `string.hashCode()` に相当します。+ * `pulsar.Murmur3_32Hash` : link:https://en.wikipedia.org/wiki/MurmurHash[Murmur3] のハッシュ関数を適用します。+ * `pulsar.BoostHash` : C++ の link:https://www.boost.org/doc/libs/1_62_0/doc/html/hash.html[Boost] ライブラリのハッシュ関数を適用します。

source: Hashing recorded configuration values
ja_jp: 記録された設定値のハッシュ化

source: Have a look at the complete overview of the authentication properties below and check the xref:security-oidc-code-flow-authentication.adoc#oidc-provider-client-authentication[OIDC provider client authentication] section for more details.
ja_jp: 以下の認証プロパティーの全容を確認し、詳細は xref:security-oidc-code-flow-authentication.adoc#oidc-provider-client-authentication[OIDC プロバイダークライアント認証] セクションを参照してください。

source: Have a look at the https://quarkus.io/version/main/guides/mailer-reference#multiple-mailer-configurations[updated documentation].
ja_jp: link:https://quarkus.io/version/main/guides/mailer-reference#multiple-mailer-configurations[更新されたドキュメント] をご覧ください。

source: Have a look at the link:security-authorization[Authorization of Web Endpoints] Guide on how to add/remove security for the GraphQL UI.
ja_jp: GraphQL UIのセキュリティを追加/削除する方法については link:security-authorization[Webエンドポイントの認可] のガイドをご覧ください。

source: Have a look at the link:security-authorize-web-endpoints-reference[Authorization of Web Endpoints] Guide on how to add/remove security for the GraphQL UI.
ja_jp: GraphQL UIのセキュリティを追加/削除する方法については、「 link:security-authorize-web-endpoints-reference[Authorization of Web Endpoints] Guide」を参照してください。

source: Have a look at the updated link:/guides/redis[Redis getting started guide] and the link:/guides/redis-reference[Redis reference guide] for more information.
ja_jp: 詳細は、 link:/guides/redis[Redis getting started guideと] link:/guides/redis-reference[Redis reference guide] をご覧ください。

source: Have a look at the xref:extension-maturity-matrix.adoc[extension maturity matrix].
ja_jp: xref:extension-maturity-matrix.adoc[エクステンション成熟度マトリックス] を参照してください。

source: Have a more in-depth look at how SmallRye Stork can be configured and used.
ja_jp: SmallRye Storkがどのように構成されているか、どのように使用されているか、より詳細にご覧いただけます。

source: Have a nice holiday break if you take one, and happy coding/experimenting if you don't, and see you all next year.
ja_jp: 休暇を取る場合は素敵な休暇をお過ごしください。そうでない場合はコーディング/実験を楽しんでください。来年もお会いしましょう。

source: Have fully automated (and documented) CI/CD practices.
ja_jp: 完全に自動化された（文書化された）CI/CDプラクティスを持っていること。

source: Have fun!
ja_jp: 楽しんでください!

source: Have fun, Max
ja_jp: 楽しんでね、マックス

source: Have gone through the link:https://redhat-developer-demos.github.io/knative-tutorial/knative-tutorial/index.html[Knative Tutorial], specifically link:https://redhat-developer-demos.github.io/knative-tutorial/knative-tutorial/eventing/eventing-trigger-broker.html[Brokers and Triggers]
ja_jp: link:https://redhat-developer-demos.github.io/knative-tutorial/knative-tutorial/index.html[Knative チュートリアル] 、具体的には link:https://redhat-developer-demos.github.io/knative-tutorial/knative-tutorial/eventing/eventing-trigger-broker.html[ブローカーとトリガー]

source: Have suggestions or feedback? Feel free to https://github.com/redhat-developer/vscode-quarkus/issues/new[open a GitHub issue].
ja_jp: ご意見・ご感想はこちらお気軽に link:https://github.com/redhat-developer/vscode-quarkus/issues/new[GitHub issueをオープンしてください]。

source: Have the xref:doc-reference.adoc[Quarkus documentation reference] handy as a reference for required syntax and other conventions.
ja_jp: 必要な構文やその他の規約のリファレンスとしてxref:doc-reference.adoc[Quarkus ドキュメントリファレンス] を手元に用意してください。

source: Have the xref:doc-reference.adoc[Quarkus style and content guidelines] handy as a reference for required syntax and other conventions.
ja_jp: 必要な構文やその他の規約のリファレンスとして xref:doc-reference.adoc[Quarkus スタイル・コンテンツガイドライン] を使用してください。

source: Having `final` classes however does not work well with various frameworks that need to create https://docs.oracle.com/javase/8/docs/technotes/guides/reflection/proxy.html[Dynamic Proxies].
ja_jp: しかし、 `final` クラスであることは、 link:https://docs.oracle.com/javase/8/docs/technotes/guides/reflection/proxy.html[ダイナミックプロキシー] を作成する必要がある様々なフレームワークではうまく機能しません。

source: Having a Kubernetes Client extension in Quarkus is very useful in order to unlock the power of Kubernetes Operators. Kubernetes Operators are quickly emerging as a new class of Cloud Native applications. These applications essentially watch the Kubernetes API and react to changes on various resources and can be used to manage the lifecycle of all kinds of complex systems like databases, messaging systems and much more. Being able to write such operators in Java with the very low footprint that native images provide is a great match.
ja_jp: Kubernetes Operatorのパワーを引き出すためには、QuarkusにKubernetesクライアントエクステンションがあると非常に便利です。Kubernetes Operatorは、クラウドネイティブアプリケーションの新しい種類として急速に台頭してきています。これらのアプリケーションは、基本的にKubernetes APIを監視し、様々なリソースの変更に反応し、データベースやメッセージングシステムなど、あらゆる種類の複雑なシステムのライフサイクルを管理するために使用することができます。ネイティブイメージが提供する非常に低いフットプリントで、このようなOperatorをJavaで書くことができるということは、非常にマッチしています。
